load-test.yml
config:
  environments:
    production:
      target: "https://beta.hometown.in"
      phases:
        - duration: 60
          arrivalRate: 50
    staging:
      target: "https://stage.hometown.in"
      phases:
        - duration: 60
          arrivalRate: 50
scenarios:
  - name: "Homepage"
    flow:
      - get:
          url: "/"